; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	infrared0 - mode
	image2 - mode
	thermograph1 - mode
	GroundStation0 - direction
	Star3 - direction
	Star2 - direction
	Star4 - direction
	GroundStation5 - direction
	GroundStation1 - direction
	Planet6 - direction
	Planet7 - direction
	Star8 - direction
	Star9 - direction
	Star10 - direction
	Star11 - direction
	Planet12 - direction
	Star13 - direction
	Star14 - direction
)
(:init
	(supports instrument0 image2)
	(supports instrument0 thermograph1)
	(calibration_target instrument0 GroundStation1)
	(calibration_target instrument0 Star2)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet12)
	(supports instrument2 thermograph1)
	(supports instrument2 infrared0)
	(supports instrument2 image2)
	(calibration_target instrument2 GroundStation1)
	(supports instrument3 image2)
	(calibration_target instrument3 Star2)
	(calibration_target instrument3 Star4)
	(supports instrument4 infrared0)
	(calibration_target instrument4 GroundStation1)
	(calibration_target instrument4 GroundStation5)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star2)
	(supports instrument5 thermograph1)
	(supports instrument5 image2)
	(supports instrument5 infrared0)
	(calibration_target instrument5 Star3)
	(calibration_target instrument5 GroundStation0)
	(supports instrument6 image2)
	(supports instrument6 infrared0)
	(supports instrument6 thermograph1)
	(calibration_target instrument6 Star3)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet12)
	(supports instrument7 image2)
	(supports instrument7 infrared0)
	(calibration_target instrument7 Star4)
	(calibration_target instrument7 Star2)
	(supports instrument8 infrared0)
	(supports instrument8 image2)
	(supports instrument8 thermograph1)
	(calibration_target instrument8 Star4)
	(supports instrument9 infrared0)
	(supports instrument9 thermograph1)
	(calibration_target instrument9 GroundStation1)
	(calibration_target instrument9 GroundStation5)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star14)
)
(:goal (and
	(pointing satellite0 Planet12)
	(have_image Planet6 image2)
	(have_image Planet7 infrared0)
	(have_image Star8 infrared0)
	(have_image Star9 thermograph1)
	(have_image Star10 infrared0)
	(have_image Star11 image2)
	(have_image Planet12 thermograph1)
	(have_image Star13 thermograph1)
	(have_image Star14 image2)
))

)

; plan
1. (turn_to satellite1 groundstation1 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 groundstation1)
   goals met: 1 of 10
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 1 of 10
3. (calibrate satellite1 instrument2 groundstation1)
   added: (calibrated instrument2)
   goals met: 1 of 10
4. (turn_to satellite1 star11 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 star11)
   goals met: 1 of 10
5. (take_image satellite1 star11 instrument2 image2)
   added: (have_image star11 image2)
   goals met: 2 of 10
6. (turn_to satellite1 star10 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star10)
   goals met: 2 of 10
7. (take_image satellite1 star10 instrument2 infrared0)
   added: (have_image star10 infrared0)
   goals met: 3 of 10
8. (turn_to satellite1 planet7 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 planet7)
   goals met: 3 of 10
9. (take_image satellite1 planet7 instrument2 infrared0)
   added: (have_image planet7 infrared0)
   goals met: 4 of 10
10. (turn_to satellite1 planet6 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 planet6)
   goals met: 4 of 10
11. (take_image satellite1 planet6 instrument2 image2)
   added: (have_image planet6 image2)
   goals met: 5 of 10
12. (turn_to satellite1 planet12 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 planet12)
   goals met: 5 of 10
13. (take_image satellite1 planet12 instrument2 thermograph1)
   added: (have_image planet12 thermograph1)
   goals met: 6 of 10
14. (turn_to satellite1 star13 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 star13)
   goals met: 6 of 10
15. (take_image satellite1 star13 instrument2 thermograph1)
   added: (have_image star13 thermograph1)
   goals met: 7 of 10
16. (turn_to satellite1 star14 star13)
   deleted: (pointing satellite1 star13)
   added: (pointing satellite1 star14)
   goals met: 7 of 10
17. (take_image satellite1 star14 instrument2 image2)
   added: (have_image star14 image2)
   goals met: 8 of 10
18. (turn_to satellite1 star8 star14)
   deleted: (pointing satellite1 star14)
   added: (pointing satellite1 star8)
   goals met: 8 of 10
19. (take_image satellite1 star8 instrument2 infrared0)
   added: (have_image star8 infrared0)
   goals met: 9 of 10
20. (turn_to satellite1 star9 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 star9)
   goals met: 9 of 10
21. (take_image satellite1 star9 instrument2 thermograph1)
   added: (have_image star9 thermograph1)
   goals met: 10 of 10
